app/controllers/reservations_controller.rb

  def create
    @reservation = Reservation.new(reservation_params)
    if @reservation.save
---
INSERT INTO "reservations" ("name", "email", "party_size", "date", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"